const hobbyList1 = [
  "旅行・お出かけ",
  "音楽鑑賞",
  "ハンドメイド",
  "占い",
  "映画鑑賞",
  "天体観測",
  "DIY",
  "ガーデニング",
  "SNS",
  "ボランティア",
  "お菓子作り",
  "ペットのお世話",
  "ファッション・メイク",
  "サブカル"
];
const hobbyList2 = [
  "スポーツ",
  "楽器演奏",
  "ダイビング",
  "サイクリング",
  "将棋・チェス",
  "読書",
  "サバゲー",
  "アクアリウム",
  "コスプレ",
  "スマホゲーム",
  "裁縫",
  "小説執筆",
  "コレクション",
  "ボードゲーム"
];
const hobbyList3 = [
  "アウトドア",
  "テレビゲーム",
  "カラオケ",
  "アニメ・漫画",
  "料理",
  "イラスト",
  "プラモデル",
  "グルメ",
  "写真撮影",
  "マジック",
  "登山",
  "温泉巡り",
  "お人形遊び",
  "TRPG"
];
export const hobbyList = [...hobbyList1, ...hobbyList2, ...hobbyList3];

export const subjectList = [
  "国語",
  "数学",
  "理科",
  "地理",
  "歴史",
  "英語",
  "家庭科",
  "技術",
  "情報",
  "美術",
  "音楽",
  "体育",
  "倫理",
  "勉強そのもの"
];

export const committeeList = [
  "生徒会委員",
  "図書委員",
  "体育委員",
  "美化委員",
  "飼育委員",
  "緑化委員",
  "保健委員",
  "広報委員",
  "風紀委員",
  "生活委員",
  "アルバム委員",
  "ボランティア委員",
  "学祭実行委員",
  "生徒会役員"
];

const clubList1 = [
  "ソフトボール部",
  "テニス部",
  "バレーボール部",
  "バスケットボール部",
  "卓球部",
  "サッカー部",
  "弓道部",
  "剣道部",
  "柔道部",
  "ダンス部",
  "チアリーディング部",
  "陸上部",
  "水泳部",
  "掛け持ち"
];
const clubList2 = [
  "吹奏楽部",
  "演劇部",
  "文芸部",
  "家庭科部",
  "茶華道部",
  "美術部",
  "軽音部",
  "天文学部",
  "園芸部",
  "新聞部",
  "放送部",
  "写真部",
  "囲碁将棋部",
  "帰宅部"
];
const clubList3 = [
  "キャンプ部",
  "オカルト研究部",
  "ボランティア部",
  "eスポーツ部",
  "漫画研究部",
  "クイズ部",
  "コンピュータ部",
  "探偵部",
  "ファッション部",
  "アニメ研究部",
  "恋愛部",
  "手品部",
  "ボードゲーム部",
  "TRPG部"
];
export const clubList = [...clubList1, ...clubList2, ...clubList3];

const arbeitList1 = [
  "レストラン",
  "花屋",
  "喫茶店",
  "ペットショップ",
  "コンビニエンスストア",
  "居酒屋",
  "スーパーマーケット",
  "新聞配達",
  "本屋",
  "ファストフード店",
  "カラオケ店",
  "巫女",
  "ヴォイドハンター",
  "読者モデル"
];
const arbeitList2 = [
  "回転寿司",
  "お弁当屋",
  "CD・DVDショップ",
  "配食サービス",
  "おにぎり屋",
  "ケーキ屋",
  "アパレル販売",
  "インテリア・雑貨屋",
  "家庭教師",
  "塾",
  "ガソリンスタンド",
  "結婚式場スタッフ",
  "ホテルスタッフ",
  "イベントスタッフ"
];
const arbeitList3 = [
  "引っ越し業者",
  "チラシ配り",
  "リゾートバイト",
  "警備員",
  "ドラマ・映画のエキストラ",
  "ヒーローショーアシスタント",
  "データ入力",
  "映画館",
  "在宅ワーク",
  "メイドカフェ",
  "バーテンダー",
  "着ぐるみの中の人",
  "ガイドヘルパー",
  "レンタル彼女"
];
export const arbeitList = [...arbeitList1, ...arbeitList2, ...arbeitList3];

const foodList1 = [
  "ケーキ",
  "タルト",
  "クレープ",
  "シュークリーム",
  "アイスクリーム",
  "エクレア",
  "パフェ",
  "チョコレート",
  "クッキー",
  "いちご大福",
  "マカロン",
  "フィナンシェ",
  "ティラミス",
  "タピオカミルクティー"
];
const foodList2 = [
  "ラーメン",
  "ハンバーグ",
  "オムライス",
  "カレーライス",
  "パスタ",
  "ピザ",
  "焼肉",
  "たこ焼き",
  "サンドイッチ",
  "パンケーキ",
  "寿司",
  "からあげ",
  "鍋",
  "ごはん"
];
const foodList3 = [
  "サラダ",
  "焼きそばパン",
  "うどん",
  "果実",
  "コロッケ",
  "肉まん",
  "ドーナツ",
  "お好み焼き",
  "ステーキ",
  "たまご焼き",
  "たい焼き",
  "紅茶",
  "スナック菓子",
  "エナジードリンク"
];
export const foodList = [...foodList1, ...foodList2, ...foodList3];

const dreamList1 = [
  "医者",
  "アイドル",
  "パティシエール",
  "イラストレーター",
  "漫画家",
  "俳優",
  "声優",
  "アスリート",
  "教師",
  "料理人",
  "配信者",
  "モデル",
  "ファッションデザイナー",
  "旅人"
];
const dreamList2 = [
  "小説家",
  "ピアニスト",
  "バイオリニスト",
  "アナウンサー",
  "保育士",
  "看護師",
  "キャビンアテンダント",
  "アニマルトレーナー",
  "ミュージシャン",
  "フィギュアスケーター",
  "総理大臣",
  "宇宙飛行士",
  "外交官",
  "社長"
];
const dreamList3 = [
  "獣医",
  "美容師",
  "公務員",
  "パン屋さん",
  "ウェイトレス",
  "プロゲーマー",
  "新聞記者",
  "カウンセラー",
  "研究者",
  "警察",
  "探偵",
  "お花屋さん",
  "秘書",
  "主婦"
];
export const dreamList = [...dreamList1, ...dreamList2, ...dreamList3];

export const motivationList = [
  "プリンセスやドレスコードを可愛いと思ったから",
  "プリンセスになって活躍することで、有名になりたかったから",
  "過去にヴォイド事件に巻き込まれたとき、プリンセスに助けられたことがあるから",
  'プリンセスとはまた別の"自分の将来の夢"を叶えるため',
  "フェアリーテイルに大好きなプリンセスがいるから",
  "フェアリーテイルでのキラキラした学園生活に憧れているから",
  "プリンセスになって活躍することで、皆から憧れられる存在になりたいから",
  "自分の母親または姉妹がプリンセスだったから",
  "プリンセスになること、またはフェアリーテイルに通うことを友達に誘われたから",
  "毎日が退屈で、刺激を味わいたいと思ったから",
  "ただ、強くなりたかったから",
  "青空を飛んでみたかった、または青空を飛ぶことに憧れていたから",
  "特に理由はない"
];

export const troubleList = [
  "外見に関すること",
  "友達に関すること",
  "将来に関すること",
  "お金に関すること",
  "勉強に関すること",
  "恋愛に関すること",
  "自分の性格に関すること",
  "家族に関すること",
  "趣味に関すること",
  "アルバイトに関すること",
  "部活に関すること",
  "委員会に関すること",
  "プリンセスに関すること",
  "特に悩みはない"
];
export const memoryList = [
  "挫折したことがある",
  "大切な人との別れを経験したことがある",
  "恋をしたことがある",
  "何かで賞をとったことがある",
  "家出したことがある",
  "将来の夢を諦めたことがある",
  "みんなで協力して何かを成し遂げたことがある",
  "プリンセスに助けられたことがある",
  "かけがえのない友達ができた",
  "メディアに出たことがある",
  "大切な約束をしたことがある",
  "入院していたことがある",
  "海外で暮らしていたことがある",
  "記憶を喪失している"
];
